tap "homebrew/autoupdate"
tap "jandedobbeleer/oh-my-posh"
tap "k1low/tap"
tap "mongodb/brew"
tap "redis/redis"
tap "sinelaw/fresh"
tap "steipete/tap"
brew "glib"
brew "cairo"
brew "zstd"
brew "harfbuzz"
brew "openssl@3"
brew "python@3.12"
brew "autojump"
brew "bat"
brew "certigo"
brew "chezmoi"
brew "cloc"
brew "cmake"
brew "gmp"
brew "coreutils"
brew "cowsay"
brew "libyaml"
brew "pkgconf"
brew "crystal"
brew "ctop"
brew "openblas"
brew "dlib"
brew "docker"
brew "dylibbundler"
brew "elixir"
brew "eza"
brew "fortune"
brew "fresh-editor"
brew "fzf"
brew "libxml2"
brew "gedit"
brew "gh"
brew "git"
brew "unbound"
brew "gnutls"
brew "pinentry"
brew "gnupg"
brew "golangci-lint"
brew "graphviz"
brew "helix"
brew "himalaya"
brew "htop"
brew "httpd"
brew "hurl"
brew "hyperfine"
brew "imagemagick"
brew "jj"
brew "jq"
brew "lazydocker"
brew "lazygit"
brew "liblzf"
brew "libmemcached"
brew "libpq"
brew "libreadline-java"
brew "libsixel"
brew "mariadb"
brew "mkcert"
brew "neovim"
brew "nmap"
brew "nss"
brew "nvm"
brew "opensearch"
brew "tmux"
brew "overmind"
brew "parallel"
brew "php"
brew "pinentry-mac"
brew "pnpm"
brew "postgresql@14"
brew "pyenv"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "signal-cli"
brew "thefuck"
brew "tree"
brew "unzip"
brew "vips"
brew "wget"
brew "wimlib"
brew "yarn"
brew "zlib"
brew "zoxide"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "k1low/tap/octocov"
brew "mongodb/brew/mongodb-community"
brew "steipete/tap/bird"
brew "steipete/tap/gogcli"
brew "steipete/tap/imsg"
brew "steipete/tap/remindctl"
cask "ghostty"
cask "librecad"
cask "vscodium"
cask "wezterm@nightly"
vscode "1yib.rust-bundle"
vscode "aaron-bond.better-comments"
vscode "alexdauenhauer.catppuccin-noctis"
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.vscode-gemfile"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.codespaces"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "honnamkuan.golang-snippets"
vscode "iotacb.vesper-vibrant"
vscode "jkiviluoto.tws"
vscode "johnpapa.vscode-peacock"
vscode "johnpapa.winteriscoming"
vscode "josemurilloc.aura-spirit-dracula"
vscode "koihik.vscode-lua-format"
vscode "matt-meyers.vscode-dbml"
vscode "mike-lischke.vscode-antlr4"
vscode "mohd-akram.vscode-html-format"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "mvllow.rose-pine"
vscode "naco-siren.gradle-language"
vscode "naumovs.color-highlight"
vscode "neonxp.gotools"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "openai.openai-chatgpt-adhoc"
vscode "pavlitsky.yard"
vscode "pkief.material-icon-theme"
vscode "pulkitgangwar.nextjs-snippets"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rlnt.keep-a-changelog"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "searking.preview-vscode"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sissel.shopify-liquid"
vscode "skyapps.fish-vscode"
vscode "subframe7536.custom-ui-style"
vscode "sumneko.lua"
vscode "tamasfe.even-better-toml"
vscode "testdouble.vscode-standard-ruby"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "waderyan.gitblame"
vscode "whizkydee.material-palenight-theme"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
go "github.com/bootdotdev/bootdev"
cargo "fd-find"
cargo "spotify_player"
cargo "tlrc"
